org/jekyll/_drafts/2024-10-22-iq-is-stable.html
---
layout: post.liquid
title:  "Human intelligence (IQ) is stable"
date: 2024-10-22
last_updated: 2024-10-22
tags:
  - journal
  - intelligence
  - stable
  - iq
  - ai
categories: [journal, ai]
permalink: /2024-10-22-iq-is-stable
toc: false
---

<p>
Humans learn new skills all the time but we don't think they are smarter
because of it; why do we consider AI systems smarter when they acquire
new skills?
</p>
<div id="outline-container-org36d9d8d" class="outline-2">
<h2 id="org36d9d8d"><span class="section-number-2">1.</span> Human intelligence on adults is stable over time</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>adult humans can learn new skills that allow us to solve more
tasks:

<ul class="org-ul">
<li>even after learning new things, it is expected that
intelligence will remain stable and not increase in proportion
to the number of skills/tasks that we have mastered</li>

<li>for artificially intelligent systems, it seems that acquiring
new skills or being able to solve more take effectively
increases the system's rank in the relevant benchmarks; in a
way for AI systems it's ok to believe that more skills/tasks
means higher intelligence</li>

<li>intelligence tests for humans and machines are different:

<ul class="org-ul">
<li>IQ and g-factor are measures of an individual's variance in
performance with respect to a population</li>

<li>Typical AI benchmarks typically measure performance on
specific tasks.</li>
</ul></li>
</ul></li>
</ol>


<p>
A notable exception is <a href="https://pgpbpadilla.github.io/chollet-general-intelligence-test">Chollet's proposed measure for intelligence</a>,
which tries to measure skill acquisition efficiency.          
</p>

<ol class="org-ol">
<li><p>
In the ARC challenge, the intelligence of a given system depends
on the task
</p>

<p>
A system may seem more or less intelligent depending on the
difficulty of the task and on whether the task falls within the
scope of the system.
</p>

<ul class="org-ul">
<li>intuitively this also makes sense for humans, if the task is
outside of the scope of tasks that we can solve, it may seems
that we are not very intelligence; conversely if a task is
very easy it may give the impression that we're very smart if
we use the level of effort as a proxy for intelligence,
namely, if the effort required is small it must be cause our
intellect is large</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-org8cb4f23" class="outline-2">
<h2 id="org8cb4f23"><span class="section-number-2">2.</span> <span class="todo TODO">TODO</span> What does IQ measure?</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>IQ operationalize the g-factor</li>
</ol>
</div>
</div>
<div id="outline-container-org761ad82" class="outline-2">
<h2 id="org761ad82"><span class="section-number-2">3.</span> <span class="todo TODO">TODO</span> relationship to g-factor</h2>
<div class="outline-text-2" id="text-3">
<p>
The <a href="https://en.wikipedia.org/wiki/G_factor_(psychometrics)">g-factor</a> tries to measure the variance in intelligence amongst
individuals.
</p>

<p>
Intelligence tests measure various domains of intelligence, e.g.,
visual, logical, verbal, etc.  By measuring distinct aspects of
intelligence, we can find correlations between them and identify
the common factor &#x2013; the g-factor &#x2013; that <i>connects</i> them all.
</p>
</div>
</div>
<div id="outline-container-org5568f9d" class="outline-2">
<h2 id="org5568f9d"><span class="section-number-2">4.</span> <span class="todo TODO">TODO</span> IQ and g-factor are an oversimplification</h2>
</div>


<div id="outline-container-orge2dc891" class="outline-2">
<h2 id="orge2dc891"><span class="section-number-2">5.</span> <span class="todo TODO">TODO</span> Artificial General Intelligence</h2>
<div class="outline-text-2" id="text-5">
<p>
There are two ways that I can interpret the goal of trying to build
<i>general</i> intelligence:
</p>

<ol class="org-ol">
<li>trying to recreate the kind of intelligence that the g-factor
tries to measure</li>
<li>trying to recreate the kind of intelligence that can be used to
solve any kind of problem</li>
</ol>


<p>
Improving the performance on any of the two interpretations above
would make our artificial agents capable to solve problems that
have not seen during training.
</p>
</div>
</div>
